# Используем официальный образ Golang в качестве базового образа
FROM golang:1.21

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл go.mod и go.sum для эффективного кэширования зависимостей
COPY go.mod .
COPY go.sum .

# Загружаем зависимости
RUN go mod download

# Копируем все файлы из текущего каталога внутрь контейнера
COPY . .

# Собираем Go приложение
RUN go build -o main ./cmd/gateway

# Устанавливаем порт, который будет слушать приложение
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
CMD ["./main"]
